# YOLOv8n-Swin Transformer Config
# Based on YOLOv8n but with a Swin Backbone

# Parameters
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'n', 's', 'm', 'l', 'x'
  n: [0.33, 0.25, 1024]  # summary: 225 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPs

# YOLOv8.0n backbone
# SWIN args: [embed_dim, depths, num_heads, window_size]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SwinTransformer, [96, [2, 2, 6, 2], [3, 6, 12, 24], 7]] # 0-P2/4, P3/8, P4/16, P5/32
  
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 0], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)
